# Curve Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Curve Methods
Curve Class See Also
---
The Curve type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clone | Returns a copy of this curve. |
| ComputeClosestPoints | Find the closest points between two curves. Closest points mean closest pairs of points, each pair consisting of a point on this, say P1, and a point on other curve, say P2. P1 and P2 are closest locally. Each pairs of closest points will be represented by the corresponding parameter values with respect to the two curves and the 3d points. A closest pair is also known as a pair of critical points of the distance function between points of the two curves. If the input parameter returnAllCriticalPoints is set to false, then the function will return only pairs with minimum distance. |
| ComputeDerivatives | Returns the vectors describing the curve at the specified parameter. |
| ComputeNormalizedParameter | Computes the normalized curve parameter from the raw parameter. |
| ComputeRawParameter | Computes the raw parameter from the normalized parameter. |
| CreateOffset | Creates a new curve that is an offset of the existing curve. |
| CreateReversed | Creates a new curve with the opposite orientation of the existing curve. |
| CreateTransformed | Crates a new instance of a curve as a transformation of this curve. |
| Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject.) |
| Distance | Returns the shortest distance from the specified point to this curve. |
| Equals | Determines whether the specified Object is equal to the current Object.  (Inherited from GeometryObject.) |
| Evaluate | Evaluates and returns the point that matches a parameter along the curve. |
| GetEndParameter | Returns the raw parameter value at the start or end of this curve. |
| GetEndPoint | Returns the 3D point at the start or end of this curve. |
| GetEndPointReference | Returns a stable reference to the start point or the end point of the curve. |
| GetHashCode | Gets the integer value of the geometry object as hash code  (Inherited from GeometryObject.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| Intersect(Curve) | Calculates the intersection of this curve with the specified curve. |
| Intersect(Curve, IntersectionResultArray%) | Calculates the intersection of this curve with the specified curve and returns the intersection results. |
| IsInside(Double) | Indicates whether the specified parameter value is within this curve's bounds. |
| IsInside(Double, Int32%) | Indicates whether the specified parameter value is within this curve's bounds and outputs the end index. |
| MakeBound | Changes the bounds of this curve to the specified values. |
| MakeUnbound | Makes this curve unbound. |
| Project | Projects the specified point on this curve. |
| SetGraphicsStyleId | Sets the graphics style id for this curve. |
| Tessellate | Valid only if the curve is bound. Returns a polyline approximation to the curve. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
Curve Class
Autodesk.Revit.DB Namespace